const houses = [
  {
    name: "Ланістери",
    content: {
      house: "Дім: Ланістери",
      sigil: "Герб: Золотий лев, що стоїть на задніх лапах, на малиновому полі",
      words: "Клич: Почуй мій рев!",
      titles: "Титул: Хранителі Заходу",
      seat: "Фортеця: Скеля Кастерлі",
      region: "Регіон: Західні землі",
      head: "Лорд: Тайвін Ланістер",
      founded: "Засновник: Ланн Розумний",
      about:
        "Опис: Ланністери з Кручі Кастерлі — одна із Шляхетних родин Вестероса. Керують у Західних землях.",
      history:
        "Історія: Ланністери високі, красиві і светловолосі, вони ведуть свій родовід від андалов, які змогли знищити могутнє королівство Західні землі Західних землях, по чоловічій лінії і від Ланна Розумного, легендарного пройдисвіта і шахрая, який зміг заволодіти Кручею Кастерлі, по жіночій лінії. Довгий час Ланністери правили Західними землями як Королі Скелі. Останнім з цієї королівської династії став Лоран Ланністер. Об'єднавшись з Королем Простор Мірному Гарднером, він виставив проти Эйгона Таргаріена шістдесят тисяч воїнів, але зазнав поразки в битві, відомої як Поле вогню. З цього часу Ланністери служать королю на залізному троні в якості верховних лордів Західних земель та хранителів заходу. Золоті копальні Скелі Кастерли і Золотого Зуба зробили Ланністерів найбагатшим з великих будинків. Тітос Ланністер, батько нинішнього глави дому Тайвіна Ланністеров, привів будинок в занепад, розгубивши значні кошти на неблагонадійних вкладеннях. В результаті вассальный будинок Рейнов підняв повстання. Тайвін Ланністер зумів не тільки придушити його, але і відновити колишню репутацію будинку. Влаштувавши шлюб своєї дочки Серсеї з Робертом Баратеоном в обмін на підтримку у війні проти Божевільного Короля, Тайвін в результаті поріднився з майбутнім королем. У Серсеи народилося троє дітей, батьком яких був не король, а її брат Джеймі.",
    },
  },
  {
    name: "Арени",
    content: {
      house: "Дім: Арени",
      sigil: "Герб: Білий сокіл, що летить, і місяць на синьому тлі",
      words: "Клич: Високий як честь",
      titles: "Титул: Хранителі Сходу",
      seat: "Фортеця: Орлине Гніздо",
      region: "Регіон: Долина Аррен",
      head: "Лорд: Джон Арен",
      founded: "Засновник: Артіс Аррен",
      about:
        "Опис: Аррени — один з великих будинків Вестероса. Вони правлять у Долині Арренів тисячу років.",
      history:
        "Історія: Згідно з легендою, будинок був заснований сером Артісом Арреном, який прилетів верхи на соколі і приземлився на найвищій горі долини. Потім він переміг Короля Грифонів, останнього гірського короля перших людей, і став першим королем гір і долин. Його нащадки продовжили правити в долині до вторгнення Ейгона Таргарієна, після чого вони стали підкорятися Королю на Залізному троні. Замок Орлине Гніздо вважається неприступним і захищає його жителів від нападу диких племен. Лорд Джон Аррен був шанованим і благородним чоловіком. Він виховував Еддарда Старка і Роберта Баратеона. Коли була викрадена Ліанна Старк, а Божевільний король стратив Рікарда Старка, Джон Аррен підняв повстання. До нього приєдналися Старки і Баратеони. Вони уклали союз з будинком Таллі шляхом одруження Еддарда Старка на Кейтілін Таллі. Після перемоги новий король Роберт Баратеон призначив Джона Аррена правицею. Протягом наступних сімнадцяти років Джон виконував свої обов'язки, поки не виявив, що діти Роберта і Серсеї зовсім не були схожі на нащадків короля. Незабаром після цього він тяжко захворів і раптово помер. У Джона залишилися дружина Ліза і син Робін.",
    },
  },
  {
    name: "Баратеони",
    content: {
      house: "Дім: Баратеони",
      sigil:
        "Герб: Чорний коронований олень, що стоїть на задніх ногах, на золотому полі",
      words: "Клич: Нам — лють",
      titles: "Титул: Верховні Володарі Штормових Земель",
      seat: "Фортеця: Штормова Межа",
      region: "Регіон: Штормові землі",
      head: "Лорд: Роберт Баратеон",
      founded: "Засновник: Оріс Баратеон",
      about:
        "Опис: Баратеони — один з великих домів Вестероса, і наймолодший з них.",
      history:
        "Історія: Родоначальником дому є Оріс Баратеон, який був воєначальником у Ейгона Завойовника. Ходили чутки, що Оріс є бастардом і зведеним братом Ейгона. Оріс вбив останнього короля Штормового Межі, Аргилака Гордовитого, і зайняв замок. Його доньку, Аргеллу, він взяв у дружини.",
    },
  },
  {
    name: "Старки",
    content: {
      house: "Дім: Старки",
      sigil: "Герб: Сірий лютововк на білому фоні",
      words: "Клич: Зима близько",
      titles: "Титул: Захисники Півночі",
      seat: "Фортеця: Вінтерфелл",
      region: "Регіон: Північ",
      head: "Лорд: Еддарт Старк",
      founded: "Засновник: Брандон Будівельник",
      about:
        "Опис: Дуже стародавній рід, вважається, що їх родовід не переривався з часів Брандона Будівельника, який жив десь вісім тисяч років тому. Як і багато інших домів Півночі, вони зберегли віру в Старих Богів.",
      history:
        "Історія: Довгий час Старки правили своїми землями як Королі Півночі. Але після вторгнення на Вестерос Ейгона I Таргарієна король Торрхен Старк здався, побачивши драконів, яких старий Таргарієн привів з собою на битву. Так Старки отримали титул «верховних лордів Півночі» і стали служити королю на залізному троні як хранителі Півночі. Через триста років лорд Еддард Старк поріднився з будинком Таллі, одружившись на Кейтілін Таллі. Під час повстання Роберта Баратеона Еддард і його люди воювали на стороні Роберта та допомогли йому зійти на трон.",
    },
  },
  {
    name: "Таллі",
    content: {
      house: "Дім: Таллі",
      sigil: "Герб: Стрибаюча срібна форель серед червоно-синіх хвиль",
      words: "Клич: Сім'я, обов'язок, честь",
      titles: "Титул: Лорди Ріверрана",
      seat: "Фортеця: Ріверран",
      region: "Регіон: Річкові землі",
      head: "Лорд: Едмар Таллі",
      founded: "Засновник: Едмін Таллі",
      about:
        "Опис: Правителі Річкових земель, правлять з родового замку Ріверран, на чолі якого стоїть лорд Ріверрана. На даний момент це Едмур Таллі.",
      history:
        "Історія: Будинок Таллі завоював високе становище під час Завойовницької війни. Едмін Таллі, який у той час був головою цього благородного будинку, підтримав Таргарієнів і підняв повстання проти короля, який у той час правив Залізними островами і Річковими землями, Харрена Чорного. Лорди Річкових земель на чолі з Едміном взяли верх, і, коли Эйгон I Таргарієн завоював континент і зайняв престол, він дарував Едміну титул верховного лорда Річкових земель, і з тих пір нащадки Едміна успадковують цей титул. До недавнього часу главою будинку Таллі був Хостер Таллі. Його дочки Кейтілін і Ліза, дружини лордів Еддарда Старка і Джона Аррена, під час Повстання Роберта сформували великий альянс їх будинків. Історично склалося так, що Річкові землі часто ставали місцем військових дій. Щоб вижити, будинок Таллі постійно укладав шлюбні союзи з іншими благородними будинками.",
    },
  },
  {
    name: "Мартелли",
    content: {
      house: "Дім: Мартели",
      sigil:
        "Герб: Червоне сонце, простромлене золотим списом на помаранчевому тлі",
      words: "Клич: Непохитні, незламні, ніколи не здамося",
      titles: "Титул: Принци Дорна",
      seat: "Фортеця: Сонячний Спис",
      region: "Регіон: Дорн",
      head: "Лорд: Доран Мартел",
      founded: "Засновник: Морган Мартелл",
      about:
        "Опис: Мартелли — одна із шляхетних родин Вестероса. Вони правлять південним регіоном на континенті, Дорном, з замку Сонячний Спис.",
      history:
        "Історія: Тисячу років тому войовнича королева ройнар Німерія перетнула Вузьке море разом зі своїми людьми, рятуючись від драконів Валірії. Після висадки на берег вона спалила всі кораблі, щоб ні один боягуз не міг повернутися назад. Німерія потрапила до Дорн і вийшла заміж за Морсу Мартелла, в результаті чого утворився дуже могутній будинок. Разом вони змогли згуртувати цей регіон, який у той час складався з безлічі розрізнених царств. У Дорні і раніше у жінок було більше прав і свободи, ніж у всьому іншому Вестеросі. Після весілля Морсу і Німерії, Мартелли стали слідувати традиціям ройнар, і взяли собі титул принців. Спадкоємцем або спадкоємицею ставала старша дитина, незалежно від статі, і дорнийці слідували за своєю принцесою точно так само, як і за принцом. За часів вторгнення Ейгона дорнийці вирішили не вступати у відкритий бій з драконами і сховалися. Рейніс, яка вирушила на підкорення Дорна, пішла ні з чим. Через кілька років її нащадок, Дейрон I вирішив спробувати знову. Йому вдалося завоювати Дорн і правити там протягом декількох місяців. Але одного разу вночі на його стюарда Ліонеля Тірелла напали червоні скорпіони, і він загинув від отрути. Незабаром після цього Таргаріени були переможені. Мартелли продовжили правити Дорном незалежно від Таргаріенів, поки, зрештою, Дорн не став частиною Семи Королівств. Це сталося після шлюбу Дейрона II і Miriї Мартелл, а сестра Дейрона II Дейнеріс вийшла заміж за Марона Мартелла. Багато років потому відбувся ще один шлюб Мартеллів і Таргаріенів. Елія Мартелл вийшла заміж за Рейгара Таргаріена. Незабаром вибухнуло повстання Роберта, і Елія разом з дітьми була вбита.",
    },
  },
  {
    name: "Грейджої",
    content: {
      house: "Дім: Грейджої",
      sigil: "Герб: Золотий кракен на чорному тлі",
      words: "Клич: Ми не сіємо",
      titles: "Титул: Лорди Залізних островів",
      seat: "Фортеця: Пайк",
      region: "Регіон: Залізні острови",
      head: "Лорд: Бейлон Грейджой",
      founded: "Засновник: Сірий Король",
      about:
        "Опис: Грейджої - один з великих будинків Вестероса. Управляють Залізними островами із замку Пайк. Символ цього будинку – золотий кракен на чорному тлі, а їхній девіз – «Ми не сіємо».",
      history:
        "Історія: Будинок Грейджоїв походить від Сірого Короля, легендарного Короля Залізних островів. Згідно з повір'ями, він правив тисячу років і взяв за дружину русалку. Як і більшість залізнонароджених, вони вірять у Бога, що потонув. На момент початку Війни п'яти королів на чолі будинку був Бейлон Грейджой. За вісім років до подій Війни п'яти королів він підняв повстання проти влади Залізного трону. Повстання закінчилося для Бейлона поразкою, двоє його синів, Родрік і Марон, загинули. Третього сина, Теона, взяв у заручники Еддард Старк, його відвезли у замок Вінтерфелл, де виховувався і навчався разом із дітьми Старка. Поруч із Бейлоном залишилася лише дочка Яра.",
    },
  },
  {
    name: "Тірелли",
    content: {
      house: "Дім: Тірелли",
      sigil: "Герб: Золота троянда на зеленому полі",
      words: "Клич: Виростаючи — міцніємо",
      titles: "Титул: Верховні Володарі Простору",
      seat: "Фортеця: Хайгарден",
      region: "Регіон: Простір",
      head: "Лорд: Мейс Тіррел",
      founded: "Засновник: Алестер Тірелл",
      about:
        "Опис: Вони правлять Простором — великими, родючими і густонаселеними землями на південному заході континенту. Родовий замок Тіреллів — Хайгарден.",
      history:
        "Історія: Будинок Тіреллов був гілкою будинку Гарднерів, давніх королів Простору. Століттями Тірелли служили як кастеляни Хайгардена. Поступово їх могутність зростала, вони ставали сильнішими і навіть скріпляли узи шлюбу з могутніми благородними будинками Простору. Під час Завойовницької війни король Мерн Гарднер був спалений живцем у битві, яка отримала назву Поле Вогню, його вбили дракони Таргаріенів. Померли також його спадкоємці. Після цього Харлен Тірелл добровільно здав Хайгарден Эйгону Таргаріену, той в нагороду зробив Тірелла лордом Хайгардена і верховним лордом Простору, хоча в Просторі були і інші благородні будинку з більш близькими родинними зв'язками з Гарднерами. Історію Тіреллів чудово характеризує їх герб — за красою троянди ховаються шипи. Тірелли здаються чесними і справедливими, на ділі вони не менш хитрі, ніж Ланністери, і їм не чужі палацові інтриги і політичні ігри. Протягом багатьох років у військових конфліктах Тірелли завжди приєднувалися до тих, хто з найбільшою ймовірністю повинен вийти з конфлікту переможцем. Це було і під час завоювання Таргаріенів, і під час повстання Роберта. Під час повстання Роберта Тірелли здобули переконливу перемогу у битві біля Эшфорда, а потім обложили Штормову Межу. Але після смерті Божевільного короля вони відразу здалися і присягнули на вірність Роберту Баратеону.",
    },
  },
];

const image = [
  {
    name: "Ланістери",
    images: {
      icon: "Скеля Кастерлі, замок на скелі, що знаходиться біля узбережжя та дорога до нього:images/images/сasterly.png",
    },
  },
  {
    name: "Арени",
    images: {
      src: "Орлине гнізно, на найвищій скелі Вестеросу та дорога між горами до нього:images/images/The_Eyrie.png",
    },
  },
  {
    name: "Баратеони",
    images: {
      src: "Великий та високий замок на скелі біля узбережжя на фоні штормового моря:images/images/barateon.png",
    },
  },
  {
    name: "Старки",
    images: {
      src: "Великий замок посеред снігів, який освітюють сотні факелів у ночі, армія зашисників перед замком:images/images/stark.png",
    },
  },
  {
    name: "Таллі",
    images: {
      src: "Замок посеред річки, та міст до нього:images/images/riveran.png",
    },
  },
  {
    name: "Мартелли",
    images: {
      src: "Сонячний спис, високий світлий замок посеред міста на високому пагорбі біля морі:images/images/martel.png",
    },
  },
  {
    name: "Грейджої",
    images: {
      src: "Замок на декількох гострих скелях біля моря, з'єднаних між собою підвісними мостами:images/images/iron.png",
    },
  },
  {
    name: "Тірелли",
    images: {
      src: "Світлий замок на пагорбі, посеред міста де багато зелені:images/images/tirell.png",
    },
  },
];

// ------------------------------------------------Content DB -------------------------------

const itemMenu = document.querySelector(".container__block-menu");

function item(event) {
  if (
    event.code === "Enter" ||
    event.type === "click" ||
    event.code === "Space"
  ) {
    let clickTagName = event.target.tagName;
    if (clickTagName != "DIV") return;
    const targetHouse = event.target.textContent;
    let targetHouseContent = houses.find(
      (item) => item.name == targetHouse
    ).content;
    let houseDB = Object.values(targetHouseContent)
      .map((text) => {
        let classItem = text.split(":")[0];
        let content = text.split(":")[1];
        let className = "none";
        let elem = "span";
        switch (classItem) {
          case "Дім":
            className = "house";
            elem = "h2";
            break;
          case "Герб":
            className = "sigil";
            elem = "span";
            break;
          case "Клич":
            className = "words";
            elem = "span";
            break;
          case "Титул":
            className = "titles";
            elem = "span";
            break;
          case "Фортеця":
            className = "seat";
            elem = "span";
            break;
          case "Регіон":
            className = "region";
            elem = "span";
            break;
          case "Лорд":
            className = "head";
            elem = "span";
            break;
          case "Засновник":
            className = "founded";
            elem = "span";
            break;
          case "Опис":
            className = "about";
            elem = "p";
            break;
          case "Історія":
            className = "history";
            elem = "p";
            break;
        }
        let createElemSpan = document.createElement("span");
        createElemSpan.textContent = classItem + ":";
        createElemSpan.setAttribute("class", "title-about");

        let createElemBr = document.createElement("br");

        let createElem = document.createElement(elem);
        createElem.textContent = content;
        createElem.setAttribute("class", className);
        return (
          createElemSpan.outerHTML +
          createElem.outerHTML +
          createElemBr.outerHTML
        );
      })
      .join("");

    let targetHouseImage = image.find(
      (item) => item.name == targetHouse
    ).images;
    let cotentImage = Object.values(targetHouseImage)
      .map((img) => {
        let alt = img.split(":")[0];
        let src = img.split(":")[1];
        let createElem = document.createElement("img");
        createElem.setAttribute("src", src);
        createElem.setAttribute("class", "content__img");
        createElem.setAttribute("alt", alt);
        createElem.setAttribute("tabindex", "0");
        createElem.setAttribute("title", alt);
        return createElem.outerHTML;
      })
      .join("");

    document.getElementById("content").innerHTML = houseDB + cotentImage;
  }
}

itemMenu.addEventListener("click", item);
itemMenu.addEventListener("keyup", item);

// ------------------------------------------------Title hiden image ------------------------------------

const ironTron = document.querySelector(".header__title");

function tron(event) {
  if (
    event.code === "Enter" ||
    event.type === "click" ||
    event.code === "Space"
  ) {
    let createElem = document.createElement("img");
    createElem.setAttribute("src", "images/images/iron_tron.jpg");
    createElem.setAttribute("class", "tron__img");
    createElem.setAttribute(
      "alt",
      "Король ночі на Залізному Троні, біля трону всі головні герої які стали білими ходаками та служать йому"
    );
    createElem.setAttribute("tabindex", "0");
    createElem.setAttribute("title", "Альтернативна історія Вестероса");
    document.getElementById("content").innerHTML = createElem.outerHTML;
  }
}

ironTron.addEventListener("click", tron);
ironTron.addEventListener("keyup", tron);

// ------------------------------------------------Default ------------------------------------

function ready() {
  let createElem = document.createElement("img");
  createElem.setAttribute("src", "images/images/title.jpeg");
  createElem.setAttribute("class", "title__img");
  createElem.setAttribute(
    "alt",
    "Залізний Трон зроблений з тисяч мечів в тронному залі замку"
  );
  createElem.setAttribute("tabindex", "0");
  createElem.setAttribute("title", "Тронний зал Червоного Замку");
  document.getElementById("content").innerHTML = createElem.outerHTML;
}

document.addEventListener("DOMContentLoaded", ready);

// ------------------------------------------------Action Menu ------------------------------------

const menu = document.querySelectorAll(".container__block-menu div");
menu.forEach((item) => {
  item.addEventListener("click", (e) => {
    menu.forEach((el) => {
      el.classList.remove("active");
    });
    item.classList.add("active");
  });
});
