const sportBrands = [
    {   
    id: 1,
    textContent: "Пу́ма (нім. Puma) — німецька компанія — один із світових лідерів виробництва спортивних товарів. Заснована в 1924 році братами Дасслерами як «Dassler». Сучасна назва з'явилася 1948 року, після того, як брати Дасслер розірвали відносини і утворили власні компанії. Рудольф спочатку назвав свою фірму Руда (від перших літер і'мя та прізвища Рудольф Дасслер), але вже за декілька місяців переіменував її в Пума (Puma).",
    image: "./img/puma.jpeg",
},
{   id: 2,
    textContent: "Nike — американська компанія, виробник спортивних товарів. Засновано в 1964 студентом Філом Найтом, бігуном на середні дистанції в команді Університету Орегону, та його тренером Біллом Боуерманом у Юджині. Спочатку компанія носила назву «Blue Ribbon Sports» й спеціалізувалась на замовленнях кросівок в азійських країнах й наступному продажу їх на американському ринку. Nike — один з найбільших виробників спортивних товарів у світі.",
    image: "./img/nike.jpeg",
    
},
{   id: 3,
    textContent: "Адідас (нім. Adidas) — німецька компанія, один зі світових лідерів виробництва спортивних товарів. Заснована в 1924 році братами Дасслерами як «Dassler». Сучасна назва з'явилася 1948 року, після того, як брати Дасслер розірвали відносини і утворили власні компанії. Adidas походить від перших трьох літер прізвиська молодшого брата Адольфа «Adi» і трьох перших літер прізвища (Das) засновника фірми Адольфа Дасслера, (Adolf Dassler).",
    image: "./img/adidas.png",
    
}, 
{    id: 4,
    textContent: "Reebok — американська компанія з виробництва спортивного одягу, взуття та аксесуарів. Штаб-квартира розташована в Бостоні (штат Массачусетс ). З 2005 року є дочірнім підрозділом компанії Adidas. Reebok виробляє та поширює спортивний одяг для фітнесу, бігу та кросфіту, включаючи аксесуари та взуття. У 2006 році відбулося злиття з Adidas.",
    image: "./img/reebok.png",
    
},
{   id: 5,
    textContent: "Columbia Sportswear, Коламбія спортсвер — американський виробник й продавець верхнього та спортивного одягу із головним офісом у Бівертоні, Орегон. Виробами Колумбії також є взуття, капелюхи, туристичні товари, лижній одяг (на 2001 рік Коламбія була найбільшим американським виробником)та верхнього одягу акксесуари.Коламбія продає свої вироби у 13 тисячах магазинах у 72 країнах світу.",
    image: "./img/columbia.png",
    
},
{   id: 6,
    textContent: "Існують також інші бренди спортивного одягу такі як: New Balance, Converse, Asics, Vans та інші. Дані бренди також користуються популярністю серед споживачів. Асортимент товарів даних брендів вельми різноманітний та прийдеться до смаку навіть найвибагливішим покупцям. Стиль та якість товару дійсно перебуває на високому рівні.",
    image: "./img/brands.jpeg",
  
}
];

const buttonActive = document.querySelector('.sidenav');
const content = document.querySelector('.content');


buttonActive.addEventListener("click", ({ target }) => {
    const idx = target.parentElement.id;
    const brand = sportBrands.filter(({ id }) => id == idx);
    const [ { image, textContent } ] = brand;
    content.innerHTML = `
            <p class="text-content" id="text-content">${textContent}</p>
            <img class="image" src="${image}" alt="img">
            `;
});