'use strict';

const classesArr = [
  {
    name: "Воїн",
    description:
      "Воїни ретельно готуються до бою, а з противником борються віч-на-віч, приймаючи всі удари на свої обладунки. Вони користуються різними бойовими тактиками і застосовують різноманітну зброю, щоб захистити своїх тендітніших союзників. Для максимальної ефективності воїни повинні контролювати свою лють - силу, що живить їх найбільш небезпечні атаки.",
  },
  {
    name: "Паладин",
    description:
      "Паладини б'ються з ворогом віч-на-віч, покладаючись на важкі обладунки та навички цілительства. Міцний щит або дворучна зброя - не так важливо, ніж володіє паладин. Він зможе не тільки захистити соратників від ворожих кігтів і клинків, але й утримає групу на ногах за допомогою зцілення.",
  },
  {
    name: "Мисливець",
    description:
      "Мисливці б'ють ворога на відстані або в ближньому бою, наказуючи вихованцям атакувати, поки самі натягують тятиву, заряджають рушницю або розбивають древковою зброєю. Їхня зброя дієва і поблизу, і здалеку. Крім того, мисливці дуже рухливі. Вони можуть ухилитися від атаки або затримати супротивника, контролюючи поле бою.",
  },
  {
    name: "Розбійник",
    description:
      "Розбійники часто нападають із тіней, починаючи бій комбінацією лютих ударів. У затяжному бою вони вимотують ворога ретельно продуманою серією атак, перш ніж завдати вирішального удару. Розбійнику слід уважно поставитися до вибору противника, щоб оптимально використовувати тактику, і не прогаяти момент, коли треба сховатися або бігти, якщо ситуація складається не на їхню користь.",
  },
  {
    name: "Жрець",
    description:
      "Жерці можуть задіяти потужну цілющу магію, щоб урятувати себе та своїх супутників. Їм підвладні й сильні атакуючі заклинання, але фізична слабкість та відсутність міцних обладунків змушують жерців боятися зближення із противником. Досвідчені жерці використовують бойові та контролюючі здібності, не допускаючи загибелі членів загону.",
  },
  {
    name: "Шаман",
    description:
      "У бою шаман ставить на землю тотеми, що контролюють і завдають шкоди, щоб допомогти союзникам і послабити противника. Шамани можуть вступати в ближній бій, так і атакувати з відстані. Мудрий шаман завжди намагається враховувати сильні та слабкі сторони ворога.",
  },
  {
    name: "Маг",
    description:
      "Маги знищують ворогів таємними заклинаннями. Незважаючи на магічну силу, маги крихкі, не носять важких обладунків, тому вразливі у ближньому бою. Розумні маги за допомогою заклинань утримують ворога на відстані або зовсім знерухомлюють його.",
  },
  {
    name: "Чорнокнижник",
    description:
      "Чорнокнижники знищують ослабленого противника, поєднуючи хвороби і темну магію. Перебуваючи під захистом своїх вихованців, чаклуни розбивають ворога на відстані. Фізично слабкі чаклуни що неспроможні носити важку броню, тому підставляють під ворожі удари своїх слуг.",
  },
  {
    name: "Чернець",
    description:
      "Незалежно від стилю ченці в бою покладаються в основному на свої кулаки і ноги, а зв'язок з внутрішньою енергією ци надає їм сил для використання особливих здібностей. Вони здатні одночасно зцілювати союзників і завдавати шкоди противникам.",
  },
  {
    name: "Друїд",
    description:
      "Друїди можуть підходити до битви по-різному. Вони вільні грати майже будь-яку роль у команді: бути цілителями, танками чи бійцями, але повинні пам'ятати про особливості кожної ролі. Друїд змушений уважно підбирати вигляд до ситуації, оскільки кожен із навичків служить певної мети.",
  },
  {
    name: "Мисливець на демонів",
    description:
      "Мисливці на демонів не користуються важкою бронею, натомість покладаючись на швидкість, яка дає їм можливість стрімко наближатися до супротивника і завдавати йому шкоди одноручною зброєю. Однак іллідары не варто забувати про те, щоб використовувати свою спритність і в захисних цілях, забезпечуючи собі сприятливий результат битви.",
  },
  {
    name: "Лицар смерті",
    description:
      "Лицарі смерті сходяться з супротивником у ближньому бою, доповнюючи удари клинка темною магією, яка робить ворога вразливим або ранить його безбожною енергією. Вони провокують противників, змушуючи їх боротися віч-на-віч і не підпускаючи їх до слабших союзників. Щоб не дати супротивникові вислизнути, лицарі смерті повинні постійно пам'ятати про силу, яку витягують з рун, і відповідним чином спрямовувати свої атаки.",
  },
];

const classesList = document.querySelector(".menu");
const title = document.querySelector('.content__title');
const titleInnerText = title.innerText;
const description = document.querySelector('.content__description');
const descriptionInnerText = description.innerText;
const classImg = document.querySelector('.content__img');
const linkHome = document.querySelector('.content__link_back');

function printClassInformation(event) {
  const menuItem = event.target.closest("a");
  const className = menuItem.innerText;
  const classIndex = classesArr.findIndex((el) => {
      if (el.name === className) {
          return true;
        }
    });
    title.innerText = classesArr[classIndex].name;
    description.innerText = classesArr[classIndex].description;
    classImg.setAttribute("src","./assets/illustrations/" + menuItem.innerText + ".jpg");
    classImg.setAttribute("alt", classesArr[classIndex].name);
    linkHome.innerText = "Повернутися на головну сторінку";
}
classesList.addEventListener("click", printClassInformation);

function resetContent(event){
    title.innerText = titleInnerText;
    description.innerText = descriptionInnerText;
    classImg.setAttribute('src', '');
    classImg.setAttribute('alt', '');
    event.target.innerText = '';
}
linkHome.addEventListener('click', resetContent);
