const data = [
    {
        id: 0,
        name: 'Penelope Cruz',
        fullName: 'Penelope Cruz Sanchez',
        birthday: 'April 28, 1974',
        birthPlace: 'Alcobendas, Madrid, Spain',
        profession: 'actress',
        career: '1989 - present time',
        instagram: 'https://www.instagram.com/penelopecruzoficial/',
        twitter: 'https://twitter.com/PenelopeCruzOfi',
        image: 'https://i.pinimg.com/564x/97/04/ea/9704ea888ce8bf918dce7cb6d065b17c.jpg',
        description: `акторську кар'єру Пенелопа розпочала 1991 року на телебаченні. Її кінодебют відбувся через рік 
        після виходу на широкі екрани трагікомедії « Шинка, шинка », яка отримала схвалення критиків. Надалі вона 
        побудувала успішну кінокар'єру, знявшись у більш ніж п'ятдесяти фільмах, серед яких були « Відкрий очі », 
        « Країна пагорбів та долин », « Дівчина твоєї мрії », « Жінка згори », « Кокаїн » та « Ванільне небо ». Також 
        знімалася і в різножанрових картинах, включаючи " Прокинувшись в Ріно ", " Готика ", " Ноель " і " Сахара ". 
        Власниця премій « Оскар»(перша іспанська актриса, яка отримала нагороду)  і BAFTA , номінантка на 
        « Золотий глобус » за найкращу жіночу роль другого плану у фільмі « Вікі Христина Барселона ». Також працювала 
        у фільмах « Повернення » та « Дев'ять », за які була номінована на «Оскар» та «Золотий глобус». Власниця 
        іменної зірки на Алеї слави в Голлівуді. 
        Крім акторської кар'єри, Крус активно працює в модельному бізнесі - 
        вона співпрацювала з модельєром Ральфом Лореном , а також з компаніями Mango та L'Oréal . Крім того, вона 
        активно займається філантропією, регулярно жертвуючи кошти на благодійні цілі бідним країнам, та бере участь 
        у боротьбі зі СНІДом .`
    },
    {
        id: 1,
        name: 'Tom Cruise',
        fullName: 'Thomas Cruise Mapother IV',
        birthday: 'July 3, 1962',
        birthPlace: 'Syracuse, New York, USA',
        profession: 'actor, film director, screenwriter, film producer, stuntman',
        career: '1981  - present time',
        instagram: 'https://www.instagram.com/tomcruise/',
        twitter: 'https://twitter.com/tomcruise',
        image: 'https://i.pinimg.com/564x/3c/3f/90/3c3f9055247e7f661f1b343fe069068c.jpg',
        description: `у віці 18 років з благословення матері та вітчима Круз переїхав до Нью-Йорка для того, щоб стати 
        професійним актором. Після роботи помічником офіціанта в Нью-Йорку він вирушив до Лос-Анджелеса, щоб спробувати 
        себе в телевізійних ролях. Він підписав контракт із агентством CAA і почав зніматися у кіно. Дебютом для нього 
        стала невелика роль у фільмі « Безкіне кохання » (1981). Свою першу головну роль, яка принесла йому популярність,
        він отримав у фільмі « Ризований бізнес » (1983). Круз також зіграв головну роль у фільмі Рідлі Скотта 
        " Легенда ", що вийшов в 1985 . До 1986 року фільм « Кращий стрілець» закріпив його статус суперзірки. Триразовий 
        володар премії « Золотий глобус » та триразовий номінант на премію « Оскар ». Вершиною його акторської 
        майстерності переважною більшістю представників кінопреси вважається робота в драмі Магнолія , відзначена безліччю нагород.
        Круз є фанатом автоспорту . Його можна часто побачити на гоночних машинах та спортивних мотоциклах як у фільмах,
        так і в житті. У гаражі самого Тома Круза знаходиться мотоцикл Ducati 999R.`
    },
    {
        id: 2,
        name: 'Jennifer Lawrence',
        fullName: 'Jennifer Schrader Lawrence',
        birthday: 'August 15, 1990',
        birthPlace: 'Indian Hills, Jefferson, Kentucky',
        profession: 'actress',
        career: '2006 - present time',
        instagram: 'https://www.instagram.com/jenniferlawrence_/',
        twitter: 'https://twitter.com/JLawrence_RepUs',
        image: 'https://i.pinimg.com/564x/cd/7d/18/cd7d18c3d83d4b2361d8ab39f95c0734.jpg',
        description: `лауреат премії « Оскар » (2013), трьох премій « Золотий глобус » (2013, 2014, 2016), премії BAFTA (2014),
        двох « Премій Гільдії кіноакторів США » (2013, 2014) та премії « Сатурн ». Дженніфер Лоуренс розпочала акторську 
        кар'єру у 2006 році, зігравши у телепроекті «Міська компанія». Свою першу головну роль вона виконала в драмі 
        « Дом покеру  (англ.)рус.». Визнання в акторському середовищі вона отримала після ролі Тіффані в комедійній драмі 
        " Мій хлопець - псих ", а масовому глядачеві стала відома як молода Містик у фантастичних фільмах 
        " Люди Ікс: Перший клас " (2011), " Люди Ікс: Дні минулого майбутнього " ( 2014) та « Люди Ікс: Апокаліпсис » (2016).
        Найбільшу популярність актрисі принесла роль Кітніс Евердін в екранізації книжкової трилогії « Голодні ігри ». 
        У 2011 році Лоуренс у двадцятирічному віці була номінована на премію « Оскар » та « Золотий глобус » у категоріях
        « Найкраща жіноча роль » та « Найкраща жіноча роль у драматичному фільмі » за виконання ролі Рі Доллі у драмі 
        « Зимова кістка », але обидві статуетки тоді виграла Наталі Портман . У періоді між 2012 та 2013 роками здобула 
        безліч нагород за роль у комедійній драмі « Мій хлопець — псих », у тому числі « Оскар », « Золотий глобус » та 
        Премія Гільдії кіноакторів США у номінаціях « Краща жіноча роль ». Акторська робота Лоуренс у кримінальній трагікомедії
        «Афера по-американськи » принесла їй першу статуетку BAFTA (2014), другий « Золотий глобус » (2014) та номінації 
        на « Оскар » та « Премію Гільдії кіноакторів США ». Найвища оплачувана актриса 2014-2015 року за версією журналу Forbes .`
    },
    {
        id: 3,
        name: 'Nicolas Cage',
        fullName: 'Nicholas Kim Coppola',
        birthday: 'January 7, 1964',
        birthPlace: 'Long Beach, California, US',
        profession: 'actor, film director, film producer',
        career: '1981 - present time',
        instagram: 'https://www.instagram.com/nicolascagefans/',
        twitter: 'https://twitter.com/nicolas_coppola/',
        image: 'https://i.pinimg.com/564x/1a/ee/3f/1aee3fcc489339842e2656247ff4c593.jpg',
        description: `актор-початківець відразу змінив своє прізвище на Кейдж, щоб дистанціюватися від свого знаменитого 
        дядька Френсіса Форда Копполи. Прототипами для нового імені послужили герой коміксів Люк Кейдж та композитор-авангардист
        Джон Кейдж. Дебютом у кіно для Кейджа стала епізодична роль у комедії « Швидкі зміни у школі Ріджмонт-Хай ». Кейдж 
        отримав премію Оскар за роль алкоголіка-самогубця у фільмі « Покидаючи Лас-Вегас ». Потім отримав номінацію за 
        зображення реального сценариста Чарлі Кауфмана та його вигаданого близнюка у фільмі « Адаптація ». Більшість ролей 
        Кейджа так і залишилися непоміченими. Більшість фільмів Кейджа, які досягли фінансового успіху, були у жанрі бойовика
        та пригод. У своєму другому, за касовими зборами, фільм « Скарб нації » він грає ексцентричного історика, який 
        вирушає в небезпечну пригоду, щоб знайти скарби. Інші кінохіти включають: « Скелю », в якому Кейдж грає молодого 
        експерта ФБР з хімічної зброї, « Без обличчя » та « Вежі-близнюки », фільм режисера Олівера Стоуна про теракти 11 вересня.
        За свій внесок у розвиток кіноіндустрії удостоєний зірки на голлівудській «Алеї слави» з номером 7021.`
    },
    {
        id: 4,
        name: 'Jennifer Aniston',
        fullName: 'Jennifer Joanna Aniston',
        birthday: 'February 11, 1969',
        birthPlace: 'Sherman Oaks, California, US',
        profession: 'actress, film director, producer',
        career: '1988 - present time',
        instagram: 'https://www.instagram.com/jenniferaniston/',
        twitter: 'https://mobile.twitter.com/celebjenaniston/',
        image: 'https://i.pinimg.com/564x/34/e9/98/34e9984e9664702540efd17ac1d1611a.jpg',
        description: `Актриса відома як виконавиця ролі Рейчел серіалі каналу NBC « Друзі » (1994—2004), за яку вона була 
        удостоєна премій « Еммі » (2002) та « Золотий глобус » (2003). Власниця іменної зірки на голлівудській «Алеї слави».
        Також популярність актрисі принесли головні ролі в комедійних фільмах, таких як: « Брюс Всемогутній » (2003), 
        « Розлучення по-американськи » (2006), « Обіцяти — не означає одружуватися » (2009), « Мисливець за головами » (2010 ),
        « Більше, ніж друг » (2010), « Прикинься моєю дружиною » (2011), « Нестерпні боси » (2011), « Ми — Міллери » (2013),
        « Вкради мою дружину » (2013), « Нестерпні леді » »(2016) та ін. 1 листопада 2019 року Еністон повернулася на телебачення,
        знявшись у драмі « Ранкове шоу ». За роль у ньому Еністон отримала премію Гільдії кіноакторів за найкращу жіночу роль 
        у драматичному серіалі , а також була номінована на премію Еммі за найкращу жіночу роль у драматичному телесеріалі 
        та дві премії «Золотий глобус» за найкращу жіночу роль у телевізійному серіалі .
        Дженніфер Еністон вважається однією з найбільш високооплачуваних акторок у Голлівуді, в 2017 році її власний 
        капітал оцінювався $200 млн. Вона також була включена до списків найкрасивіших жінок журналами People , 
        Cosmopolitan та Esquire.`
    },
    {
        id: 5,
        name: 'Leonardo DiCaprio',
        fullName: 'Leonardo Wilhelm DiCaprio',
        birthday: 'November 11, 1974',
        birthPlace: 'Los Angeles , California , USA',
        profession: 'actor, producer, activist',
        career: '1989 - present time',
        instagram: 'https://www.instagram.com/leonardodicaprio/',
        twitter: 'https://twitter.com/LeoDiCaprio/',
        image: 'https://i.pinimg.com/564x/e9/dd/96/e9dd96491dcc9df164753392e0f4b0ee.jpg',
        description: `лауреат численних нагород, включаючи премію « Оскар » (2016), BAFTA (2016), премію Гільдії кіноакторів США (2016), 
        три премії « Золотий глобус » (2005, 2014, 2016), а також « Срібного ведмедя » кінофестивалю . Повноцінну акторську 
        кар'єру розпочав у шістнадцять років на початку 1990-х років. У 2000-х роках отримав визнання публіки та критиків
        за роботу у широкому діапазоні кіно та акторську майстерність.
        Акторський дебют у Ді Капріо відбувся у два роки, коли він виступив з імпровізованим танцем на фестивалі перфомансу. 
        У дитинстві щодо майбутньої професії Ді Капріо розмірковував про те, щоб стати біологом чи актором. Остаточно вибір 
        на користь акторської професії він зробив після того, як його старший зведений брат Адам Фаррар заробив 50 тисяч доларів, 
        знімаючись тільки в одній рекламі. Він знайшов агента, якому сподобалися і його стрижка та його ім'я. Він знявся 
        у більш ніж 30 рекламних роликах і в кількох серіалах: Санта Барбара , Нові пригоди Лессі , Розанна та інших.
        Дебютом Ді Капріо в кіно став комедійний фільм жахів " Зубастики 3 ". Картиною, що принесла Ді Капріо світову популярність,
        став « Титанік » Джеймса Кемерона . Спочатку Ді Капріо хотів відмовитися від ролі, але зрештою погодився, оскільки
        Кемерон вірив у його акторські здібності. Фільм став головною культурною подією року і був представлений в 11 категоріях
        на 70 -й церемонії вручення нагород премії «Оскар». Ді Капріо вважається одним з найкращих акторів свого покоління. 
        Слава після фільму «Титанік» лише зміцнила його статус кумира підлітків та героя-коханця, якого він прагнув досягнути.`
    },
    {
        id: 6,
        name: 'Angelina Jolie',
        fullName: 'Angelina Jolie Voight',
        birthday: 'June 4, 1975',
        birthPlace: 'Los Angeles, California, USA',
        profession: 'actress, film director, screenwriter, producer, fashion model',
        career: '1982 - present time',
        instagram: 'https://www.instagram.com/angelinajolie/',
        twitter: 'https://twitter.com/joliestweet/',
        image: 'https://i.pinimg.com/564x/36/4c/4d/364c4d7dfe4fd96b71cb2fbe1b824834.jpg',
        description: `актриса кіно, телебачення та озвучування, кінорежисер , сценаристка , продюсер, фотомодель, посол доброї волі ООН .
        Володарка премії « Оскар », трьох премій « Золотий глобус » (перша актриса в історії, яка три роки поспіль виграла премію)
        та двох « Премій Гільдії кіноакторів США ».
        Дебютувала в кіно в 1982 році, зігравши роль у комедійному фільмі « У пошуках виходу » (де знімалися також її батько і мати), 
        проте популярність здобула після того, як зіграла героїню відеоігор Лару Крофт у фільмах 
        « Лара Крофт: Розкрадача гробниць і Лара Крофт: Розкрадача гробниць 2 - Колиска життя . У 2009, 2011 і 2013 роках 
        за версією журналу Forbes Джолі була названа найоплачуванішою актрисою Голлівуду.
        Її найбільш успішними з комерційного боку фільмами стали « Малефісента » (збори у світовому прокаті – 758 мільйонів
        доларів США), « Містер і місіс Сміт » (збори у світовому прокаті – 478 мільйонів доларів США), « Особливо небезпечний » 
        (341 мільйон доларів США ) ), « Солт » (293 мільйони доларів США), а також « Турист » (278 мільйонів доларів США), 
        « Лара Крофт: Розкрадача гробниць » (274 мільйони доларів США) та картина за участю Ніколаса Кейджа « Викрасти за 60 секунд » 
        ( 237 мільйонів доларів США).
        Анджеліна Джолі неодноразово називалася провідними виданнями найкрасивішою/сексуальною жінкою світу, у тому числі 
        журналами Esquire (2004), People (2006), FHM (2006). У лютому 2007 року в Британському телевізійному шоу 
        «100 найбільших секс-символів» Джолі була обрана найвидатнішим секс-символом усіх часів.`
    },
    {
        id: 7,
        name: 'George Clooney',
        fullName: 'George Timothy Clooney',
        birthday: 'May 6, 1961',
        birthPlace: 'Lexington, Kentucky, US',
        profession: 'actor, film director, producer, screenwriter',
        career: '1978 - present time',
        instagram: 'https://www.instagram.com/george_clooney_page/',
        twitter: 'https://twitter.com/clooneysopenhse/',
        image: 'https://i.pinimg.com/564x/06/50/13/065013a12d91fdaa9c53ed790d73cf4e.jpg',
        description: `широку популярність отримав після виходів телесеріалу « Швидка допомога » та фільму « Від заходу сонця до світанку ».
        Лауреат премій « Оскар » та « Золотий глобус » у номінації «Краща чоловіча роль другого плану» за фільм « Сіріана », 
        володар премії «Золотий глобус» за роль мільйонера Метта Кінга в драмі « Нащадки » (2011) та роль в'язня, що втік, 
        у комедії « О, де ж ти, брате? »(2000). Другий раз отримав «Оскар» як продюсер у номінації « Найкращий фільм » 
        за фільм « Операція „Арго“ ». За цей фільм був удостоєний четвертого «Золотого глобуса» і першої статуетки BAFTA .
        У 2009 році був визнаний журналом Time одним із 100 найвпливовіших людей світу. Його гуманітарна діяльність включає 
        роботи з вирішення конфлікту в Дарфурі , за визнанням геноциду вірмен , допомогу постраждалим від землетрусу на Гаїті.
        Клуні бере участь у проекті Not On Our Watch Project  — організація, яка привертає увагу світової спільноти та ресурси, 
        щоб запобігти масовим злочинам, разом з Бредом Піттом , Меттом Деймоном , Доном Чідлом , Девідом Прессманом і Джеррі Вайнтраубом.
        Джордж Клуні є активним прихильником визнання геноциду вірмен . Він один із засновників премії « Аврора » — яка вручається тим, 
        хто ризикує своїм життям, щоб запобігти геноцидам і злочинам. Клуні також закликав владу США визнати геноцид вірмен.
        Після продажу компанії Casamigos Tequila Клуні очолив рейтинг найоплачуваніших акторів, опублікований Forbes у 2018 році.`
    },
    {
        id: 8,
        name: 'Mila Kunis',
        fullName: 'Milena Markovna Kunis',
        birthday: 'August 14, 1983',
        birthPlace: 'Chernivtsi, Ukraine',
        profession: 'actress',
        career: '1994 - present time',
        instagram: 'https://www.instagram.com/milakunism/',
        twitter: 'https://twitter.com/MilaKunisv/',
        image: 'https://i.pinimg.com/564x/04/c7/5a/04c75a9f2c1718734b047b684ce6ba19.jpg',
        description: `почала кар'єру 1993 року, знявшись у кількох рекламних роликах. Наступного року дебютувала на телебаченні 
        в епізоді мильної опери « Дні нашого життя », проте її прорив стався лише у 2008 році за участю у фільмі « У прольоті ». 
        Також відома озвучуванням Мег Гріффін у мультиплікаційному серіалі « Гріффіни ». За свою більш ніж двадцятирічну 
        кар'єру знялася в близько тридцяти різножанрових фільмах, серед яких Макс Пейн , Книга Ілая , Секс по дружбі , 
        Третій зайвий , Оз: Великий і Жахливий» та дилогія «Дуже погані матусі». Однією з найбільш значущих ролей актриси 
        в кіно є роль балерини Лілі у фільмі « Чорний лебідь », за яку вона була нагороджена премією « Сатурн » та номінувалася 
        на « Золотий глобус » та Премію Гільдії кіноакторів США за найкращу жіночу роль другого плану.
        Крім кіно, Куніс активно займається і модельним бізнесом - її фотографії неодноразово з'являлися на обкладинках 
        багатьох журналів серед яких:  Complex, Nylon, Cosmopolitan, W, Harper's Bazaar, Glamour та інших. У 2013 році 
        журнал Forbes розмістив актрису на 89 місці у списку ста найвпливовіших знаменитостей, причому за прибутковістю 
        вона посідала 14 місце. На кінець 2013 року актрисою було зароблено 11 млн доларів. У 2017 році посіла 5 місце в 
        списку найоплачуваніших актрис Голівуду з доходом в 15,5 млн доларів. Співпрацювала з будинком моди Christian Dior 
        та брендом Gemfields. Була неодноразово визнана однією з найоплачуваніших акторок Голлівуду.`
    },
    {
        id: 9,
        name: 'Brad Pitt',
        fullName: 'William Bradley Pitt',
        birthday: 'December 18, 1963',
        birthPlace: 'Shawnee , Oklahoma , US',
        profession: 'actor, film producer',
        career: '1987 - present time',
        instagram: 'https://www.instagram.com/bradpittofflcial/',
        twitter: 'https://twitter.com/bradpittweb',
        image: 'https://i.pinimg.com/564x/de/c4/70/dec4705970884b93c56621c8bcbeeb3b.jpg',
        description: `лауреат двох премій " Золотий глобус ". Володар премії « Оскар » як один із продюсерів фільму « 12 років рабства » 
        — переможця у категорії « Найкращий фільм » на церемонії 2014 року  — і за найкращу чоловічу роль другого плану 
        в картині « Одного разу в Голлівуді » (2020). До цього п'ять разів номінувався на премію .
        (тричі – як актор і двічі – як продюсер).
        Дебютував на телебаченні, зігравши в кількох епізодах серіалів « Інший світ » та «Проблеми зростання». 1994 року 
        в кар'єрі Пітта настав переломний момент. Спочатку він зіграв Луї де Пон дю Лака у фільмі « Інтерв'ю з вампіром » 
        за однойменною книгою Енн Райс і отримав дві премії на MTV Movie Awards 1995 . Потім він знявся у фільмі « Легенди осені » 
        за однойменним романом Джима Харрісона, зігравши Трістана Ладлоу, сина полковника Вільяма Ладлоу ( Ентоні Хопкінс ). 
        За цю роль Пітт був вперше висунутий на премію " Золотий глобус " у номінації " За кращу чоловічу роль ". Хоча фільм 
        отримав змішані відгуки, гра Пітта була високо оцінена критиками. У 1999 році Пітт зіграв одну зі своїх найвідоміших 
        ролей у фільмі « Бійцівський клуб » Девіда Фінчера за мотивами однойменного роману Чака Паланіка . У 2003 році Бред Пітт 
        вперше встав по той бік екрану, озвучивши мультфільм « Сіндбад: Легенда семи морів » та мультсеріал « Цар гори ».`
    },
]

export default data;
