[
{
    "title": "THE 1960's",
    "img": "#",
    "text": "Between the years 1959 and 1965, skateboarding became more and more popular in the United States. Particularly affected were the states on the east and west coasts. Due to the industrial development, the skateboard’s status changed from toy to sports equipment. In 1962, the surf shop “Val-Surf” in Hollywood sold the first self-produced skateboards. These boards featured a typical surfboard shape and roller skate trucks and were sold as complete boards. In the same year, the company Patterson Forbes developed the first industrially produced complete boards with more developed trucks. In 1963, the publisher of the “Surf Guide Magazine” Larry Stevenson released the first advertisement for skateboards in his magazine. Also the clothing industry specialized more and more on skateboarding. One of the most famous skateboarding shoe brand named Vans was established in 1966. From this day on, Vans supported skateboarders from all over the world. Especially shoe companies like Vans, Etnies, Converse and DC Shoes developed and manufactured skateboarding related footwear and streetwear. Vans Old SchoolAnother landmark event in 1963 was the first skate contest in Hermosa Beach, California. Skateboarding was not just cruising anymore. Skateboarders showed their skills in different disciplines like slalom or freestyle and companies started to assemble a team to sponsor the riders. As the popularity of skateboarding began to expand, the first skateboarding magazine “The Quarterly Skateboarder” was published in 1964. A next big step was the further development of the shape of the boards. Larry Stevenson invented the “kicktail“, and with it came a lot more possibilities to ride a skateboard."
},
{
    "title": "THE 1970's",
    "img": "#",
    "text": "The only consistent thing is change and so it came to a point where everything changed for skateboarding. Frank Nasworthy’s invention of urethane wheels in 1972 made it possible for skateboarding to come back. Nasworthy started the company Cadillac Wheels and with the new material it was possible to ride smoother, faster and more comfortable. A variety of disciplines such as freestyle, downhill and slalom experienced a real high point. New magazines like the “Skateboarder Magazine” from 1975 were published and new events were launched. In 1976, the first artificially created skate park was inaugurated and new parks emerged with new elements such as vertical ramps and kickers. Gadillac Wheels In the mid-1970s, skateboarding reached Germany. The American soldiers brought the trend with them and by 1976 Munich became the first German skateboard center. In Munich Neuperlach, the first skate park was built, first skateboard magazines followed and in 1978 the first German skateboard championships were held in Munich. All the different riders with their individual styles enhanced lots of new tricks. Therefore, skateboarding hardware was developed further and further: Shapes changed, boards became wider, got more concave and they featured nose and tail. Then in 1978, Alan Gelfand invented a maneuver that gave skateboarding another revolutionary jump: The “Ollie”, which counts as the greatest trick ever invented and completely revolutionized skateboarding. That was the birth of street skateboarding!"
},
{
    "title": "THE 1980's",
    "img": "#",
    "text": "Rodney Mullen was one of the first riders who transferred the Ollie for different maneuvers onto the streets and spread a new style of skateboarding. Next to other fun sport activities like BMX or inline skating, street skateboarding developed more and more and became very popular. In 1981, the “Thrasher Magazine” was founded and since then, this magazine stands for street skateboarding, the core scene, punk rock and the lifestyle slogan “Skate And Destroy”. In 1983, another well-known magazine was founded, namely the “Transworld Skateboarding Magazine”. Next to these magazines, a few smaller ones were founded and more skate shops opened. Because of this, the popularity of skateboarding continued to grow. A global dissemination of new tricks and unseen skate maneuvers allowed the first skate videos on VHS. Videography has become increasingly important to the scene. Titus Dittmann was instrumental in the development of skateboarding in Germany. He imported skate-related products from the US and organized contests and various skateboarding events. The “Münster Monster Mastership” became one of the biggest international skateboarding competitions in the 1980s. For that reason, skateboarding became more and more famous in Germany. From the mid-1980s on, it was possible to earn good money as a professional skateboarder and the skateboard industry boomed in the US. In the late 1980s, companies like Powell Peralta, Santa Cruz and Vision dominated the international market of the scene. The fashion was mainly determined by shoes. Shoes by Vans, Converse or Vision became flagships for the skateboarding scene. Skateboarding was now absolutely established the US and in Germany and vert skateboarding was replaced by street skateboarding. The number of skateboarders increased significantly and professional skateboarders became more and more famous just like baseball or football stars."
},
{
    "title": "FROM THE 1990's",
    "img": "#",
    "text": "In the early 1990s, skateboarding went through a further depth phase due to the increase in various trend sports. So skateboarding went back to its roots. But because of the digitalization, skateboarding maintained its presence in public. From the mid-1990s, the modern skateboarding experienced a next high phase, which continues until today. Mega events like the “X-Games” were launched and televised. Due to numerous magazines, all the events, videos and last but not least the internet, skateboarding became common worldwide. Because of brands like Chocolate, Girl Skateboards or Flip Skateboards, the skateboarding hardware was developed more and more and skateboarders could buy high-quality skateboards in every bigger city. More indicators are the big and worldwide known events of “Street League”. “Street League Skateboarding” is a contest series for international pro skaters. Here, you only see the best street skateboarder you can think of like Nyjah Huston, Eric Koston, Paul Rodriguez, Andrew Reynolds, Ryan Sheckler or Torey Pudwill. Due to the cash prizes of 200.000 US Dollars or more for the winner and 10.000 visitors at the “Street League” stops, skateboarding has become a professional sport. In Germany, street skating is the most popular discipline at contests just like in the USA. The European and German skate scene is independent, has its own industry, pros and a national contest series. This is an evidence of how big the role of skateboarding is in our society. Skateboarding has become a job for a lot of people. Because of the increasing networking inside the skate scene, skateboarding will grow and bring more innovations in the future. But for the most of us, skateboarding is and will be a hobby and an attitude to life."
}
]