const clubs = [
    {
        id: 0,
        name: 'Milan',
        img: 'img/milan.png',
        description: '«Мила́н» — итальянский профессиональный футбольный клуб из одноимённого города. «Милан» — один из самых успешных клубов мира и самый титулованный из Италии по количеству международных трофеев. В 1963 году стал первым клубом из Италии, выигравшим Кубок европейских чемпионов.'
    },
    {
        id: 1,
        name: 'Manchester City',
        img: 'img/manchester.png',
        description: '«Манче́стер Си́ти» — английский профессиональный футбольный клуб из Манчестера, выступающий в Премьер-лиге, высшем дивизионе в системе футбольных лиг Англии. Был основан в 1880 году под названием «Сент Маркс ». В 1887 году был переименован в «Ардуик». С 1894 года называется «Манчестер Сити».'
    },
    {
        id: 2,
        name: 'Real',
        img: 'img/real.png',
        description: '«Реа́л Мадри́д» — испанский профессиональный футбольный клуб из города Мадрид. Признан ФИФА лучшим футбольным клубом XX века. «Реал Мадрид» — один из трёх клубов, которые ни разу не покидали высший испанский дивизион, двумя другими являются «Барселона» и «Атлетик Бильбао».'
    },
    {
        id: 3,
        name: 'Metalurg',
        img: 'img/metalurh.png',
        description: '«Металлу́рг» — футбольный клуб из города Запорожье. в новейшей истории была неизменным участником чемпионатов Украины и даже имела опыт выступлений в тогдашнем Кубке УЕФА. Домашние матчи проводит на стадионе «Славутич-Арена». Сейчас играет во второй лиге. Ждём возвращения в высшую лигу в 2023г.'
    }
];

export default clubs;