[
    {
        "img" : "img/crustula.png",
        "altText" : "crustula planet",
        "title" : "crustula",
        "subtitle" : "spider-aliens",
        "descr" : "Evil Rick and Evil Morty built a secret hideout/torture chamber on this planet, where they held thousands of kidnapped Mortys and tortured them in order to create 'Morty waves' to camouflage their own brain waves. Rick Sanchez, after being framed for their murders and escaping the Council of Ricks, tracked them down to this planet and defeated Evil Rick with the help of Morty Smith."
    },
    {
        "img" : "img/dwarf-terrace-9.png",
        "altText" : "dwarf terrace 9 planet",
        "title" : "dwarf terrace 9",
        "subtitle" : "tiny pigs",
        "descr" : "In 'The Wedding Squanchers', the Smith Family were seaking refuge outside of Galactic Federation's jurisdiction. Only three planets with inhabitable climates were located, the best of which was Dwarf Terrace-9. The Smiths did not stay there for long, as Rick overheard the family discuss him and their problems, and deciding to give himself to the authorities. After his capture, the Smiths were picked up by Galactic Federation ships and sent back to Earth."
    },
    {
        "img" : "img/fantasy-world.png",
        "altText" : "fantasy world planet",
        "title" : "fantasy world",
        "subtitle" : "people and other creatures in a medieval style",
        "descr" : "This planet is the planet that Morty took Rick to when he could choose his next adventure in 'Meeseeks and Destruction'. They found the village in which Morty began his search for gold in Giant's World, which is located high in the sky above the surface of the planet. When they reached Giant's World, they were charged with 'giant murder' after a fatal accident, but released because they never read about their rights.They then reached a bar where Morty was attacked by King Gelatin and Rick won a large amount of shmeckles which they gave to the village before they left."
    },
    {
        "img" : "img/gasorpazorp.png",
        "altText" : "gasorpazorp planet",
        "title" : "gasorpazorp",
        "subtitle" : "Gazorpians",
        "descr" : "Gazorpazorp is a planet in the Andromeda Galaxy. As a result of conflicts, the two genders divided. While the females flourished and advanced, the males became primitive. The females created incubation sex robots in order to continue the growth of their race without having to procreate with males, retrieving them once the males finish copulation. Summer and Rick were forced into visiting the homeworld after a sex doll, bought by Rick at an interplanetary Pawn Shop, gave birth to Morty Jr.. In the end, however, they leave the planet, avoiding death by trial."
    },
    {
        "img" : "img/gear-world.png",
        "altText" : "gear world planet",
        "title" : "gear world",
        "subtitle" : "inhabitants of the planet: Gear People",
        "descr" : "Geardude of Gear World joined Rick Sanchez, Birdperson, Squanchy and more to fight the Galactic Federation before they could conquer the whole universe. At some point after the Battle of Blood Ridge, Geardude's funeral was held on Gear World. Rick Sanchez and Morty Smith brought Fart to Gearhead's workshop on Gear World after escaping the Galactic Federation. They were quickly betrayed by Gearhead who tipped off the police on their location."
    },
    {
        "img" : "img/gramuflack.png",
        "altText" : "gramuflack planet",
        "title" : "gramuflack",
        "subtitle" : "gramuflacks",
        "descr" : "Shortly after going rogue, Heistotron constructed a gigantic robot to steal Gramuflack's core. The robot approached the planet dressed as a plumber named 'Hank', claiming to come to check the planet's water pressure. Heistotron placed a giant secret camera on a city, killing 57,000 people. Heistotron then changed the costume to a pizza delivery and dropped a giant pizza box on top of another city, flattening it and killing all citizens. The box started drilling into the planet, destroying all half of it, ending the planet's gravity and killing all creatures before extracting the planet core."
    },
    {
        "img" : "img/gromflom-prime.png",
        "altText" : "gromflom prime planet",
        "title" : "gromflom prime",
        "subtitle" : "Gromflomites",
        "descr" : "It used to be a good planet to live on with green nature and buildings intact. However, everything changed with the chaos that ensued in the Blemflarck Crisis, created by the human Rick Sanchez. What followed was the complete destruction of the Gromflomite society, resulting in anarchy and no standard currency. With most residences destroyed, what's left is highly valued by owners and real estate agents. It seems most housing communites now are fenced communites, with only way of getting in is to bring them a 'severed head of one of the co-op board's many dangerous enemies', according to a recently published article 'You WISH You Lived in These AMAZING Luxury Homes' from Blurtfeed."
    },
    {
        "img" : "img/pawn-shop.png",
        "altText" : "pawn shop planet",
        "title" : "pawn shop",
        "subtitle" : "alien",
        "descr" : "Rick brought Morty along to this pawn shop in search of a defraculator, but could only find a broken one. While Rick and the shop owner haggled over the price, a bored Morty was toying with a claw before seeing a sex robot lying around. He asked Rick for a souvenir, a memory from their travels together in case Rick died. Rick finally gave in and bought the broken defraculator, along with the sex robot, for 60 smidgens."
    },
    {
        "img" : "img/purge.png",
        "altText" : "purge planet planet",
        "title" : "purge planet",
        "subtitle" : "cat-like humanoids",
        "descr" : "The Purge Planet is an unnamed planet that appeared in the episode 'Look Who's Purging Now'. It is a planet that exists in the Replacement dimension, and is home of cat-like humanoids. On this planet, everyone is very blissful and happy toward everyone because every year there is a purge, where all laws are suspended for the night and everyone is free to kill whoever they want, releasing their anger without consequences."
    },
    {
        "img" : "img/screaming-sun-earth.png",
        "altText" : "screaming sun planet",
        "title" : "screaming sun earth",
        "subtitle" : "None known, except for its parent star, the Screaming Sun",
        "descr" : "The Screaming Sun Earth is one of 765 planets in the Milky Way that are at least 90 percent similar to Earth. Of those planets, it is one of three not under federal jurisdiction. It appeared in the episode 'The Wedding Squanchers'. The Smith Family rejected the planet as a choice for a new homeworld because the sun of the planet screamed at the top of its lungs non-stop, and the days there lasted 42 hours."
    },
    {
        "img" : "img/snake-planet.png",
        "altText" : "snake planet planet",
        "title" : "snake planet",
        "subtitle" : "sapient Snakes",
        "descr" : "Snake Planet is a planet in the Replacement dimension that first appeared in the episode 'Rattlestar Ricklactica'. It was inhabited by sapient Snakes, which were later reverted out of existence by Time Cops after the snakes started thoughtlessly meddling with time travel technology. Unlike most other extraterrestrial life forms in Rick and Morty, the snakes on this planet do not communicate with regular language. Instead, they communicate by hissing."  
    }
]


