[
  {
    "id" : "01",
    "title" : "Captain America: The First Avenger",
    "description" : "It is 1941 and the world is in the throes of war. Steve Rogers (Chris Evans) wants to do his part and join America's armed forces, but the military rejects him because of his small stature. Finally, Steve gets his chance when he is accepted into an experimental program that turns him into a supersoldier called Captain America. Joining forces with Bucky Barnes (Sebastian Stan) and Peggy Carter (Hayley Atwell), Captain America leads the fight against the Nazi-backed HYDRA organization.",
    "release" : "Jul 22, 2011",
    "box" : "$176.6M",
    "runtime" : "2h 4m",
    "picture" : "img/01.jpg"
  },
  {
    "id" : "02",
    "title" : "Captain Marvel",
    "description" : "Captain Marvel is an extraterrestrial Kree warrior who finds herself caught in the middle of an intergalactic battle between her people and the Skrulls. Living on Earth in 1995, she keeps having recurring memories of another life as U.S. Air Force pilot Carol Danvers. With help from Nick Fury, Captain Marvel tries to uncover the secrets of her past while harnessing her special superpowers to end the war with the evil Skrulls.",
    "release" : "Mar 8, 2019",
    "box" : "$426.8M",
    "runtime" : "2h 4m",
    "picture" : "img/02.jpg"
  },
  {
    "id" : "03",
    "title" : "Iron Man",
    "description" : "A billionaire industrialist and genius inventor, Tony Stark (Robert Downey Jr.), is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.",
    "release" : "May 2, 2008",
    "box" : "$318.3M",
    "runtime" : "2h 6m",
    "picture" : "img/03.jpg"
  },
  {
    "id" : "04",
    "title" : "Iron Man 2",
    "description" : "With the world now aware that he is Iron Man, billionaire inventor Tony Stark (Robert Downey Jr.) faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts (Gwyneth Paltrow) and \"Rhodey\" Rhodes (Don Cheadle) by his side, Tony must forge new alliances and confront a powerful new enemy.",
    "release" : "May 7, 2010",
    "box" : "$312.1M",
    "runtime" : "2h 4m",
    "picture" : "img/04.jpg"
  },
  {
    "id" : "05",
    "title" : "The Incredible Hulk",
    "description" : "Scientist Bruce Banner (Edward Norton) desperately seeks a cure for the gamma radiation that contaminated his cells and turned him into The Hulk. Cut off from his true love Betty Ross (Liv Tyler) and forced to hide from his nemesis, Gen. Thunderbolt Ross (William Hurt), Banner soon comes face-to-face with a new threat: a supremely powerful enemy known as The Abomination (Tim Roth).",
    "release" : "Jun 13, 2008",
    "box" : "$134.5M",
    "runtime" : "1h 52m",
    "picture" : "img/05.jpg"
  },
  {
    "id" : "06",
    "title" : "Thor",
    "description" : "As the son of Odin (Anthony Hopkins), king of the Norse gods, Thor (Chris Hemsworth) will soon inherit the throne of Asgard from his aging father. However, on the day that he is to be crowned, Thor reacts with brutality when the gods' enemies, the Frost Giants, enter the palace in violation of their treaty. As punishment, Odin banishes Thor to Earth. While Loki (Tom Hiddleston), Thor's brother, plots mischief in Asgard, Thor, now stripped of his powers, faces his greatest threat.",
    "release" : "Sep 13, 2011",
    "box" : "$268.0M",
    "runtime" : "1h 53m",
    "picture" : "img/06.jpg"
  },
  {
    "id" : "07",
    "title" : "Marvel's the Avengers",
    "description" : "When Thor's evil brother, Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D., initiates a superhero recruitment effort to defeat the unprecedented threat to Earth. Joining Fury's \"dream team\" are Iron Man (Robert Downey Jr.), Captain America (Chris Evans), the Hulk (Mark Ruffalo), Thor (Chris Hemsworth), the Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner).",
    "release" : "Sep 25, 2012",
    "box" : "...",
    "runtime" : "2h 23m",
    "picture" : "img/07.jpg"
  },
  {
    "id" : "08",
    "title" : "Thor: The Dark World",
    "description" : "In ancient times, the gods of Asgard fought and won a war against an evil race known as the Dark Elves. The survivors were neutralized, and their ultimate weapon -- the Aether -- was buried in a secret location. Hundreds of years later, Jane Foster (Natalie Portman) finds the Aether and becomes its host, forcing Thor (Chris Hemsworth) to bring her to Asgard before Dark Elf Malekith (Christopher Eccleston) captures her and uses the weapon to destroy the Nine Realms -- including Earth.",
    "release" : "Nov 8, 2013",
    "box" : "$206.4M",
    "runtime" : "1h 51m",
    "picture" : "img/08.jpg"
  },
  {
    "id" : "09",
    "title" : "Iron Man 3",
    "description" : "Plagued with worry and insomnia since saving New York from destruction, Tony Stark (Robert Downey Jr.), now, is more dependent on the suits that give him his Iron Man persona -- so much so that every aspect of his life is affected, including his relationship with Pepper (Gwyneth Paltrow). After a malevolent enemy known as the Mandarin (Ben Kingsley) reduces his personal world to rubble, Tony must rely solely on instinct and ingenuity to avenge his losses and protect the people he loves.",
    "release" : "May 3, 2013",
    "box" : "$409.0M",
    "runtime" : "2h 10m",
    "picture" : "img/09.jpg"
  },
  {
    "id" : "10",
    "title" : "Captain America: The Winter Soldier",
    "description" : "After the cataclysmic events in New York with his fellow Avengers, Steve Rogers, aka Captain America (Chris Evans), lives in the nation's capital as he tries to adjust to modern times. An attack on a S.H.I.E.L.D. colleague throws Rogers into a web of intrigue that places the whole world at risk. Joining forces with the Black Widow (Scarlett Johansson) and a new ally, the Falcon, Rogers struggles to expose an ever-widening conspiracy, but he and his team soon come up against an unexpected enemy.",
    "release" : "Apr 4, 2014",
    "box" : "$259.7M",
    "runtime" : "2h 15m",
    "picture" : "img/10.jpg"
  },
  {
    "id" : "11",
    "title" : "Guardians of the Galaxy",
    "description" : "Brash space adventurer Peter Quill (Chris Pratt) finds himself the quarry of relentless bounty hunters after he steals an orb coveted by Ronan, a powerful villain. To evade Ronan, Quill is forced into an uneasy truce with four disparate misfits: gun-toting Rocket Raccoon, treelike-humanoid Groot, enigmatic Gamora, and vengeance-driven Drax the Destroyer. But when he discovers the orb's true power and the cosmic threat it poses, Quill must rally his ragtag group to save the universe.",
    "release" : "Aug 1, 2014",
    "box" : "$333.7M",
    "runtime" : "2h 1m",
    "picture" : "img/11.jpg"
  },
  {
    "id" : "12",
    "title" : "Guardians of the Galaxy Vol. 2",
    "description" : "Peter Quill and his fellow Guardians are hired by a powerful alien race, the Sovereign, to protect their precious batteries from invaders. When it is discovered that Rocket has stolen the items they were sent to guard, the Sovereign dispatch their armada to search for vengeance. As the Guardians try to escape, the mystery of Peter's parentage is revealed.",
    "release" : "May 5, 2017",
    "box" : "$389.8M",
    "runtime" : "2h 15m",
    "picture" : "img/12.jpg"
  },
  {
    "id" : "13",
    "title" : "Avengers: Age of Ultron",
    "description" : "When Tony Stark (Robert Downey Jr.) jump-starts a dormant peacekeeping program, things go terribly awry, forcing him, Thor (Chris Hemsworth), the Incredible Hulk (Mark Ruffalo) and the rest of the Avengers to reassemble. As the fate of Earth hangs in the balance, the team is put to the ultimate test as they battle Ultron, a technological terror hell-bent on human extinction. Along the way, they encounter two mysterious and powerful newcomers, Pietro and Wanda Maximoff.",
    "release" : "May 1, 2015",
    "box" : "$459.0M",
    "runtime" : "2h 21m",
    "picture" : "img/13.jpg"
  },
  {
    "id" : "14",
    "title" : "Ant-Man",
    "description" : "Forced out of his own company by former protégé Darren Cross, Dr. Hank Pym (Michael Douglas) recruits the talents of Scott Lang (Paul Rudd), a master thief just released from prison. Lang becomes Ant-Man, trained by Pym and armed with a suit that allows him to shrink in size, possess superhuman strength and control an army of ants. The miniature hero must use his new skills to prevent Cross, also known as Yellowjacket, from perfecting the same technology and using it as a weapon for evil.",
    "release" : "Jul 17, 2015",
    "box" : "$180.2M",
    "runtime" : "1h 57m",
    "picture" : "img/14.jpg"
  },
  {
    "id" : "15",
    "title" : "Captain America: Civil War",
    "description" : "Political pressure mounts to install a system of accountability when the actions of the Avengers lead to collateral damage. The new status quo deeply divides members of the team. Captain America (Chris Evans) believes superheroes should remain free to defend humanity without government interference. Iron Man (Robert Downey Jr.) sharply disagrees and supports oversight. As the debate escalates into an all-out feud, Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner) must pick a side.",
    "release" : "May 6, 2016",
    "box" : "$408.1M",
    "runtime" : "2h 26m",
    "picture" : "img/15.jpg"
  },
  {
    "id" : "16",
    "title" : "Black Widow",
    "description" : "Natasha Romanoff, aka Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy, and the broken relationships left in her wake long before she became an Avenger.",
    "release" : "Jul 9, 2021",
    "box" : "$183.6M",
    "runtime" : "2h 13m",
    "picture" : "img/16.jpg"
  },
  {
    "id" : "17",
    "title" : "Black Panther",
    "description" : "After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.",
    "release" : "Feb 16, 2018",
    "box" : "$700.2M",
    "runtime" : "2h 14m",
    "picture" : "img/17.jpg"
  },
  {
    "id" : "18",
    "title" : "Spider-Man: Homecoming",
    "description" : "Thrilled by his experience with the Avengers, young Peter Parker returns home to live with his Aunt May. Under the watchful eye of mentor Tony Stark, Parker starts to embrace his newfound identity as Spider-Man. He also tries to return to his normal daily routine -- distracted by thoughts of proving himself to be more than just a friendly neighborhood superhero. Peter must soon put his powers to the test when the evil Vulture emerges to threaten everything that he holds dear.",
    "release" : "Jul 7, 2017",
    "box" : "$334.4M",
    "runtime" : "2h 13m",
    "picture" : "img/18.jpg"
  },
  {
    "id" : "19",
    "title" : "Doctor Strange",
    "description" : "Dr. Stephen Strange's (Benedict Cumberbatch) life changes after a car accident robs him of the use of his hands. When traditional medicine fails him, he looks for healing, and hope, in a mysterious enclave. He quickly learns that the enclave is at the front line of a battle against unseen dark forces bent on destroying reality. Before long, Strange is forced to choose between his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.",
    "release" : "Nov 4, 2016",
    "box" : "$232.6M",
    "runtime" : "1h 55m",
    "picture" : "img/19.jpg"
  },
  {
    "id" : "20",
    "title" : "Thor: Ragnarok",
    "description" : "Imprisoned on the other side of the universe, the mighty Thor finds himself in a deadly gladiatorial contest that pits him against the Hulk, his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela from destroying his home world and the Asgardian civilization.",
    "release" : "Nov 3, 2017",
    "box" : "$315.0M",
    "runtime" : "2h 10m",
    "picture" : "img/20.jpg"
  },
  {
    "id" : "21",
    "title" : "Ant-Man and The Wasp",
    "description" : "Scott Lang is grappling with the consequences of his choices as both a superhero and a father. Approached by Hope van Dyne and Dr. Hank Pym, Lang must once again don the Ant-Man suit and fight alongside the Wasp. The urgent mission soon leads to secret revelations from the past as the dynamic duo finds itself in an epic battle against a powerful new enemy.",
    "release" : "Jul 6, 2018",
    "box" : "$216.6M",
    "runtime" : "1h 58m",
    "picture" : "img/21.jpg"
  },
  {
    "id" : "22",
    "title" : "Avengers: Infinity War",
    "description" : "Iron Man, Thor, the Hulk and the rest of the Avengers unite to battle their most powerful enemy yet -- the evil Thanos. On a mission to collect all six Infinity Stones, Thanos plans to use the artifacts to inflict his twisted will on reality. The fate of the planet and existence itself has never been more uncertain as everything the Avengers have fought for has led up to this moment.",
    "release" : "Apr 27, 2018",
    "box" : "$678.8M",
    "runtime" : "2h 29m",
    "picture" : "img/22.jpg"
  },
  {
    "id" : "23",
    "title" : "Avengers: Endgame",
    "description" : "Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.",
    "release" : "Apr 26, 2019",
    "box" : "$858.4M",
    "runtime" : "3h 1m",
    "picture" : "img/23.jpg"
  },
  {
    "id" : "24",
    "title" : "Spider-Man: Far From Home",
    "description" : "Peter Parker's relaxing European vacation takes an unexpected turn when Nick Fury shows up in his hotel room to recruit him for a mission. The world is in danger as four massive elemental creatures -- each representing Earth, air, water and fire -- emerge from a hole torn in the universe. Parker soon finds himself donning the Spider-Man suit to help Fury and fellow superhero Mysterio stop the evil entities from wreaking havoc across the continent.",
    "release" : "Jul 2, 2019",
    "box" : "$390.7M",
    "runtime" : "2h 9m",
    "picture" : "img/24.jpg"
  },
  {
    "id" : "25",
    "title" : "Shang-Chi and the Legend of the Ten Rings",
    "description" : "Marvel Studios' \"Shang-Chi and The Legend of The Ten Rings\" stars Simu Liu as Shang-Chi, who must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization. The film also stars Tony Leung as Wenwu, Awkwafina as Shang-Chi's friend Katy and Michelle Yeoh as Jiang Nan, as well as Fala Chen, Meng'er Zhang, Florian Munteanu and Ronny Chieng.",
    "release" : "Sep 3, 2021",
    "box" : "$224.5M",
    "runtime" : "2h 13m",
    "picture" : "img/25.jpg"
  },
  {
    "id" : "26",
    "title" : "Spider-Man: No Way Home",
    "description" : "For the first time in the cinematic history of Spider-Man, our friendly neighborhood hero's identity is revealed, bringing his Super Hero responsibilities into conflict with his normal life and putting those he cares about most at risk. When he enlists Doctor Strange's help to restore his secret, the spell tears a hole in their world, releasing the most powerful villains who've ever fought a Spider-Man in any universe. Now, Peter will have to overcome his greatest challenge yet, which will not only forever alter his own future but the future of the Multiverse.",
    "release" : "Dec 17, 2021",
    "box" : "$804.4M",
    "runtime" : "2h 28m",
    "picture" : "img/26.jpg"
  },
  {
    "id" : "27",
    "title" : "Eternals",
    "description" : "Marvel Studios' Eternals features an exciting new team of Super Heroes in the Marvel Cinematic Universe, ancient aliens who have been living on Earth in secret for thousands of years. Following the events of Avengers: Endgame, an unexpected tragedy forces them out of the shadows to reunite against mankind's most ancient enemy, the Deviants.",
    "release" : "Nov 5, 2021",
    "box" : "$164.9M",
    "runtime" : "2h 37m",
    "picture" : "img/27.jpg"
  },
  {
    "id" : "28",
    "title" : "Doctor Strange in the Multiverse of Madness",
    "description" : "In Marvel Studios' \"Doctor Strange in the Multiverse of Madness,\" the MCU unlocks the Multiverse and pushes its boundaries further than ever before. Journey into the unknown with Doctor Strange, who, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
    "release" : "May 6, 2022",
    "box" : "$411.3M",
    "runtime" : "2h 6m",
    "picture" : "img/28.jpg"
  },
  {
    "id" : "29",
    "title" : "Thor: Love and Thunder",
    "description" : "\"Thor: Love and Thunder\" finds Thor (Chris Hemsworth) on a journey unlike anything he's ever faced -- a quest for inner peace. But his retirement is interrupted by a galactic killer known as Gorr the God Butcher (Christian Bale), who seeks the extinction of the gods. To combat the threat, Thor enlists the help of King Valkyrie (Tessa Thompson), Korg (Taika Waititi) and ex-girlfriend Jane Foster (Natalie Portman), who -- to Thor's surprise -- inexplicably wields his magical hammer, Mjolnir, as the Mighty Thor. Together, they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher's vengeance and stop him before it's too late.",
    "release" : "Jul 8, 2022",
    "box" : "$325.5M",
    "runtime" : "2h 5m",
    "picture" : "img/29.jpg"
  }
]
